app/Http/Controllers/AttendanceController.php

SELECT * FROM `attendances` WHERE `date` >= '2022-01-24' and `date` <= '2022-01-24' ORDER BY `id` DESC LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `attendances` WHERE `date` >= '2022-01-24' and `date` <= '2022-01-24'
---
    public function index(Request $request)
    {
        $Attendances = Attendance::orderBy('id', 'desc');
        if ($request->name) {
            $Attendances = $Attendances->where(function ($q) use ($request) {
                $q->orWhere('ProductName', 'LIKE', '%' . $request->name . '%')
                    ->orWhere('ProductBarcode', 'LIKE', '%' . $request->name . '%')
                    ->orWhere('ClientName', 'LIKE', '%' . $request->name . '%');
            });
        }
        if ($request->group_id != null)
            $Attendances = $Attendances->where('group_id', '=', $request->group_id);
        if ($request->Client_id != null)
            $Attendances = $Attendances->where('Client_id', '=', $request->Client_id);
        if ($request->Product_id != null)
            $Attendances = $Attendances->where('Product_id', '=', $request->Product_id);
        if ($request->from != null)
            $Attendances = $Attendances->where('date', '>=', $request->from);
        if ($request->to != null)
            $Attendances = $Attendances->where('date', '<=', $request->to);
        if ($request->isPresent != null)
            $Attendances = $Attendances->where('isPresent', '=', $request->isPresent);

        $Attendances = $Attendances->paginate(10);

SELECT `attendances`.`ClientName`, `attendances`.`Client_id`, SUM(attendances.ClientBenefit) as total FROM `attendances` WHERE `created_at` between '2021-12-23' and '2022-01-24 23:59:50' and `isPresent` = 1 GROUP BY `Client_id`
---
    public function getClientsBenifitsChart(Request $request)
    {
        $dataset = [];
        $user = Attendance::select(
            'attendances.ClientName',
            'attendances.Client_id',
            DB::raw("SUM(attendances.ClientBenefit) as total")
        )->whereBetween(
            'created_at',
            [$request->from, $request->to]
        )->where("isPresent", true)
            ->groupBy('Client_id')->get();

SELECT `attendances`.`ClientName`, `attendances`.`Client_id`, SUM(attendances.ClientBenefit) as total FROM `attendances` WHERE `created_at` between '2021-12-23' and '2022-01-24 23:59:50' and `isPresent` = 1 GROUP BY `Client_id` ORDER BY `total` DESC
---
    public function getClientsBenifits(Request $request)
    {
        $attendances = Attendance::select(
            'attendances.ClientName',
            'attendances.Client_id',
            DB::raw("SUM(attendances.ClientBenefit) as total")
        )->whereBetween(
            'created_at',
            [$request->from, $request->to]
        )->where("isPresent", true)->groupBy('Client_id')
            ->orderBy("total", "desc")->get();

SELECT `id`, (sum(attendances.schoolBenefit)) as total, (DATE_FORMAT(created_at, '%Y-%m')) as month_year FROM `attendances` WHERE `isPresent` = 1 GROUP BY DATE_FORMAT(created_at, '%Y-%m') ORDER BY `created_at` ASC
---
    public function getSchoolBenifitChart(Request $request)
    {
        $dataset = [];
        $user = Attendance::select(
            "id",
            DB::raw("(sum(attendances.schoolBenefit)) as total"),
            DB::raw("(DATE_FORMAT(created_at, '%Y-%m')) as month_year")
        )
            ->orderBy('created_at')
            ->groupBy(DB::raw("DATE_FORMAT(created_at, '%Y-%m')"))
            // ->where("created_at", ">=", Carbon::now()->subYear())
            ->where("isPresent", true)
            ->get();

        if ($user) {
            $dataset["data"] = $user->pluck("total");

SELECT (sum(attendances.schoolBenefit)) as total FROM `attendances` WHERE `created_at` between '2017-01-01' and '2022-11-01' and `isPresent` = 1 ORDER BY `created_at` ASC LIMIT 1
---
    public function getSchoolBenifitPeriod(Request $request)
    {
        $data = Attendance::select(
            DB::raw("(sum(attendances.schoolBenefit)) as total")
        )->whereBetween(
            'created_at',
            [$request->from, $request->to]
        )->orderBy('created_at')->where("isPresent", true)->first();

SELECT `attendances`.`group_id`, `attendances`.`Client_id`, `attendances`.`subjName`, `attendances`.`groupName`, SUM(attendances.Clientbenefit) as 'total' FROM `attendances` WHERE `attendances`.`Client_id` = '76' and `created_at` between '2021-12-23' and '2022-02-25 23:59:50' and `isPresent` = 1 GROUP BY `group_id`
---
    public function getClientBenifitById(Request $request)
    {
        $user = Attendance::select(
            'attendances.group_id',
            'attendances.Client_id',
            'attendances.subjName',
            'attendances.groupName',
            DB::raw("SUM(attendances.Clientbenefit) as 'total'")
        )
            ->where('attendances.Client_id', $request->Client_id)
            ->whereBetween(
                'created_at',
                [$request->from, $request->to]
            )->where("isPresent", true)
            ->groupBy(['group_id'])->get();

SELECT * FROM `Products` WHERE `Products`.`id` = 98 LIMIT 1
INSERT INTO `attendances` (`start`, `end`, `std_group_id`, `Product_id`, `group_id`, `groupName`, `price`, `ClientBenefit`, `schoolBenefit`, `date`, `isJustified`, `isPresent`, `ProductBarcode`, `ProductName`, `subj_id`, `subjName`, `ClientName`, `Client_id`, `updated_at`, `created_at`) VALUES ('2022-01-24', '2022-01-24', 3, 98, 99, 'تاست', 50, 30, 20, '2022-01-24', 0, 1, '5362532420341', 'Alta Little', 97, 'Quo quae.', 'Velda Bahringer', 76, '2022-01-24 13:25:51', '2022-01-24 13:25:51')
SELECT * FROM `std_group` WHERE `Product_id` = 98 and `group_id` = 99 LIMIT 1
UPDATE `std_group` SET `quotas` = '4', `std_group`.`updated_at` = '2022-01-24 13:25:51' WHERE `Product_id` = 98 and `group_id` = 99
---
    public function store(Request $request)
    {
        $validator = $this->validater();
        if ($validator->fails()) {
            return response()->json(['message' => $validator->getMessageBag(), 'data' => null], 400);
        }
        DB::beginTransaction();
        try {
            $Product =  Product::find($request->Product_id);
            $attendence =  Request()->all();
            $attendence["ProductName"] = $Product->firstname . " " . $Product->lastname;
            $user = Attendance::create($attendence);
            if ($user) {

                $ProductGroup = ProductGroup::where('Product_id', $request->Product_id)
                    ->where('group_id', $request->group_id)->first();

                if ($request->has("isPresent")) {
                    if ($request->isPresent == 1) {

                        $newQuotas =  $ProductGroup->quotas - 1;
                        ProductGroup::where('Product_id', $request->Product_id)
                            ->where('group_id', $request->group_id)->update(['quotas' => $newQuotas]);