app/Http/Controllers/AuthController.php

SELECT count(*) as aggregate FROM `users`
---
    public function index()
    {
        $users = User::orderBy('id', 'desc')->paginate(10);