app/Http/Controllers/ClientController.php

SELECT * FROM `clients` ORDER BY `id` DESC LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `clients`
---
    public function index(Request $request)
    {
        $Clients = Client::orderBy('id', 'desc');
        if ($request->name != null) {
            $Clients = $Clients->where("name", 'LIKE', '%' . $request->name . '%');
        }


        $Clients = $Clients->paginate(10);

INSERT INTO `clients` (`mobile`, `name`, `address`, `ancien`, `montant`, `photo`, `email`, `updated_at`, `created_at`) VALUES ('734523667868', 'atia djaber', 'el hj oued', 0, 0, '', 'ati4a@gmail.com', '2022-01-29 22:32:04', '2022-01-29 22:32:04')
---
    public function store()
    {

        $validator = $this->validater();
        if ($validator->fails()) {
            return response()->json(['message' => $validator->getMessageBag(), 'data' => null], 400);
        }
        $user = Client::create($validator->validate());