app/Http/Controllers/ExpenseController.php

SELECT SUM(expenses.price) as 'total' FROM `expenses` WHERE `date` between '2021-12-23' and '2022-01-26 23:59:50' LIMIT 1
---
    public function getExpansesAnalytic(Request $request)
    {
        $Expenses = Expense::select(
            DB::raw("SUM(expenses.price) as 'total'")
        )->whereBetween(
            "date",
            [
                $request->from, $request->to
            ]
        )->first();