app/Http/Controllers/GroupController.php

    public function index(Request $request)
    {
        $Groups = Group::orderBy('id', 'desc')->with(['subj', 'Client']);
        if ($request->has("name")) {
            $Groups = $Groups->where("name", 'LIKE', '%' . $request->name . '%');
        }
        $Groups =  $Groups->paginate(10);
---
SELECT * FROM `Clients` WHERE `Clients`.`id` in (4, 10, 29, 38, 59, 71, 76, 81, 92, 97)
SELECT * FROM `groups` WHERE `name` LIKE '%%' ORDER BY `id` DESC LIMIT 10 offset 0
SELECT * FROM `subjs` WHERE `subjs`.`id` in (5, 6, 12, 45, 49, 60, 65, 77, 94, 97)
SELECT count(*) as aggregate FROM `groups` WHERE `name` LIKE '%%'

    public function getGroupSubjById(Request $request)
    {
        $groups = Group::where('Client_id', $request->Client_id)->with(['subj'])
            ->get();
---
SELECT * FROM `groups` WHERE `Client_id` = '99'
SELECT * FROM `subjs` WHERE `subjs`.`id` in (56, 81)

    public function getProductByGroupId(Request $request)
    {
        $groups = Group::with('Products')
            ->find($request->id);
---
SELECT * FROM `groups` WHERE `groups`.`id` = '99' LIMIT 1
SELECT `Products`.*, `std_group`.`group_id` as `pivot_group_id`, `std_group`.`Product_id` as `pivot_Product_id` FROM `Products` inner join `std_group` on `Products`.`id` = `std_group`.`Product_id` WHERE `std_group`.`group_id` in (99)