app/Http/Controllers/PaymentController.php

    public function getById(Request $request)
    {
        $payments = Payment::where('client_id', $request->client_id);
        if ($request->has('from') && $request->has('to')) {
            $payments =   $payments->whereBetween(
                'created_at',
                [$request->from, $request->to]
            );
        }
        $payments = $payments->orderBy('id', 'desc')->paginate(10);
---
SELECT count(*) as aggregate FROM `payments` WHERE `Client_id` = '99'