app/Http/Controllers/ProductController.php

SELECT * FROM `products` WHERE `name` LIKE '%Test%' ORDER BY `id` DESC LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `products` WHERE `name` LIKE '%Test%'
---
    public function index(Request $request)
    {
        $Products = Product::orderBy('id', 'desc');
        if ($request->name != null) {
            $Products = $Products->where("name", 'LIKE', '%' . $request->name . '%');
        }
        $Products = $Products->paginate(10);

INSERT INTO `products` (`name`, `price`, `quantity`, `priceRentDay`, `priceRentHour`, `type`, `photo`, `updated_at`, `created_at`) VALUES ('Test', '345.00', 10, '23.00', '23.00', 'day', '', '2022-01-29 20:02:31', '2022-01-29 20:02:31')
---
    public function store()
    {
        $validator = $this->validater();
        if ($validator->fails()) {
            return response()->json(['message' => $validator->getMessageBag(), 'data' => null], 400);
        }
        $user = Product::create($validator->validate());

SELECT * FROM `products` WHERE `id` in ('1')
---
    public function put(Request $request)
    {
        $validator = $this->validater();
        if ($validator->fails()) {
            return response()->json(['message' => $validator->getMessageBag(), 'data' => null], 400);
        }
        $Product = Product::findOrFail($request->id);
        $Product->update($request->all());

DELETE FROM `products` WHERE `id` = 1
---
    public  function deleteProduct(Request $request)
    {
        $Product = Product::destroy($request->id);