app/Http/Controllers/SubjectController.php

SELECT * FROM `groups` WHERE `groups`.`subj_id` in (90, 91, 92, 93, 94, 95, 96, 97, 98, 99)
SELECT * FROM `subjs` WHERE `name` LIKE '%%' and `grade` LIKE '%%' and `level` LIKE '%%' ORDER BY `id` DESC LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `subjs` WHERE `name` LIKE '%%' and `grade` LIKE '%%' and `level` LIKE '%%'
---
    public function index(Request $request)
    {
        $subjs = Subj::orderBy('id', 'desc');
        if ($request->has("name")) {
            $subjs =
                $subjs->where("name", 'LIKE', '%' . $request->name . '%');
        }
        if ($request->has("grade")) {
            $subjs =
                $subjs->where("grade", 'LIKE', '%' . $request->grade . '%');
        }
        if ($request->has("level")) {
            $subjs =
                $subjs->where("level", 'LIKE', '%' . $request->level . '%');
        }
        $subjs =
            $subjs->with('groups')->paginate(10);